In [ ]:
!pip install pandas

In [8]:
import pandas as pd

In [9]:
dicionario = {
    'A':[1, 2, 3],
    'B':[-3, -2, -1],
    'C': [0, 10, 20]
}
Label = ['Linha 1', 'Linha 2', 'Linha 3']
Dataframe_01 = pd.DataFrame(dicionario, index=Label)
print(Dataframe_01)

         A  B   C
Linha 1  1 -3   0
Linha 2  2 -2  10
Linha 3  3 -1  20

In [10]:
Dataframe_01[['A','B']]

         A  B
Linha 1  1 -3
Linha 2  2 -2
Linha 3  3 -1

In [11]:
Dataframe_01['Nova Coluna'] = Dataframe_01['A'] *Dataframe_01['B']

In [12]:
Dataframe_01

         A  B   C  Nova Coluna
Linha 1  1 -3   0           -3
Linha 2  2 -2  10           -4
Linha 3  3 -1  20           -3